In [5]:
import seaborn as sns

In [6]:
data = [[1,2,3],[4,5,6]]

In [7]:
import pandas as pd

In [8]:
df =pd.DataFrame(data,columns=["A","B","C"])

In [10]:
df

   A  B  C
0  1  2  3
1  4  5  6

In [ ]:
##covariance

In [11]:
df.cov()

     A    B    C
A  4.5  4.5  4.5
B  4.5  4.5  4.5
C  4.5  4.5  4.5

In [12]:
df.corr()

     A    B    C
A  1.0  1.0  1.0
B  1.0  1.0  1.0
C  1.0  1.0  1.0

In [9]:
df = pd.read_csv('healthexp.csv')

In [10]:
df.head()

   Year        Country  Spending_USD  Life_Expectancy
0  1970        Germany       252.311             70.6
1  1970         France       192.143             72.2
2  1970  Great Britain       123.993             71.9
3  1970          Japan       150.437             72.0
4  1970            USA       326.961             70.9

In [11]:
df.cov()

                         Year  Spending_USD  Life_Expectancy
Year               201.098848  2.571883e+04        41.915454
Spending_USD     25718.827373  4.817761e+06      4166.800912
Life_Expectancy     41.915454  4.166801e+03        10.733902

In [13]:
df.corr(method="pearson")

                     Year  Spending_USD  Life_Expectancy
Year             1.000000      0.826273         0.902175
Spending_USD     0.826273      1.000000         0.579430
Life_Expectancy  0.902175      0.579430         1.000000